{"data":{"site":{"siteMetadata":{"title":"Rickard Magnusson"}},"markdownRemark":{"html":"<p>Recently I've had an urge to play some of the older retro games I remember from when I was young. So I looked through my Steam library and found that I still had not completed the Mega Man Legacy Collections I picked up a while ago. The first collection is the six first Mega Man games released for the NES and it still has the same feel as if you were playing on the NES. With too many sprites on the screen there will be lag and the almost pixel perfect jump you are trying to do on your last life over the spikes is exactly as frustrating as I remember it.</p>\n<p>Throughout the games I got flashback from the invisible block parts that you had to figured out the correct pattern to jump, either it resulted in your death by spikes or you fell down half the map and had to redo parts over and over again. Or when you get to the Gutsman's stage in Mega Man 1 and at the start of the level get to the green lifts that is really hard to get the timing down on or when you get to the parts where you have to drop down and make a guess on where the spikes will be and hope to choose the correct path or you will of course die again.</p>\n<p>All these obstacles mixed with the guessing game for what boss you should try next with the weapons you have gathered so far makes the experience as hard as I remember it being playing it as a kid. At least now I can really appreciate the levels a lot more with how they are structured. The way they are introducing new enemies and obstacles by first showing you the mechanic and later in the stages get to see the same mechanics being used in a different more difficult environment.\nThis made me remember an old video I saw years ago on how the design of Mega Man levels introduces the player to enemies and goes on to talk about the intro stage in Mega Man X and what it teaches you from just playing.</p>\n\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.26865671641791%; position: relative; height: 0; overflow: hidden;\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/8FpigqfcvlM\" title=\"Sequelitis - Mega Man Classic vs. Mega Man X\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          \n<p>One more thing the Legacy Collections comes with a Challenge Mode that throws you right into different aspects of the games. Some challenges are just straight up boss rushes where you get straight to the bosses and have to complete them in a certain amount of time while other challenges are just part of levels from different games you have to complete. Some are easier than others but I had a lot of fun playing through them even though I have yet to complete them all.</p>\n<p>It was fun to play through all of the games and see the different approaches they had and what changed between the games. The first six games are mostly the same design and does not change much graphic wise. Finding out in Mega Man 4 that you now can charge your shot is a welcome change for example. And then you start Mega Man 7 where the graphics has been updated for the SNES. It feels a bit different but it is still the same platforming you are used to.\nMega Man 8 is something other all together. It introduces voice acting, animated cutscenes and even swimming. I like the idea of the cutscenes but they are not executed well in the game, the voice acting is really subpar.\nThere is also some annoying snowboarding sections where a single mistake will just make you fall down and while a voice telling you to \"Jump! Jump!\" or \"Slide! Slide!\" and you still can't make the jumps. I feel like lots of levels have so much introduces mechanics that does not fit into the Mega Man series. After Mega Man 8 both 9 and 10 goes back to the original NES graphic style which makes it a nice ending to the legacy collection.</p>\n<p>One last thing that I feel like you should watch if you are interested in how the design of the maps of Mega Man makes it feel bigger than it is. Even though the video is talking using Mega Man 11 as a reference I feel like much of what he brings up is used in the older games as well.</p>\n\n          <div\n            class=\"gatsby-resp-iframe-wrapper\"\n            style=\"padding-bottom: 56.26865671641791%; position: relative; height: 0; overflow: hidden;\"\n          >\n            <iframe src=\"https://www.youtube.com/embed/nYxHMZX6lN8\" title=\"How Mega Man 11&apos;s Levels Do More With Less | Game Maker&apos;s Toolkit\" style=\"\n            position: absolute;\n            top: 0;\n            left: 0;\n            width: 100%;\n            height: 100%;\n          \"></iframe>\n          </div>\n          ","frontmatter":{"title":"Mega Man Legacy 🕹️"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/mega-man-legacy/"}}